#### Terraform Format and Style 🖌 `failure` (ignored)
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 Success! The configuration is valid.


#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.discord_simde.discord_role.admin will be updated in-place
  ~ resource "discord_role" "admin" {
        id          = "759778778212991066"
        name        = "Saint administrateur"
      ~ position    = 8 -> 9
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.integ will be created
  + resource "discord_role" "integ" {
      + color       = 14737408
      + hoist       = false
      + id          = (known after apply)
      + managed     = (known after apply)
      + mentionable = true
      + name        = "Integ"
      + permissions = 103924288
      + position    = 5
      + server_id   = "759778767831957535"
    }

  # module.discord_simde.discord_role.payutc will be updated in-place
  ~ resource "discord_role" "payutc" {
        id          = "776093666267758604"
        name        = "Tim Pay'UTC"
      ~ position    = 6 -> 7
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.treso will be updated in-place
  ~ resource "discord_role" "treso" {
        id          = "777569554539741255"
        name        = "Projet Flairsou"
      ~ position    = 5 -> 6
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.zapier will be updated in-place
  ~ resource "discord_role" "zapier" {
        id          = "791043844132962315"
        name        = "Zapier"
      ~ position    = 7 -> 8
        # (6 unchanged attributes hidden)
    }

  # module.github.github_repository.gesassos2_old will be updated in-place
  ~ resource "github_repository" "gesassos2_old" {
      ~ delete_branch_on_merge = false -> true
        id                     = "gesassos2_old"
        name                   = "gesassos2_old"
        # (25 unchanged attributes hidden)
    }

  # module.github.github_repository.paymoi will be updated in-place
  ~ resource "github_repository" "paymoi" {
      ~ delete_branch_on_merge = false -> true
        id                     = "paymoi"
        name                   = "paymoi"
        # (25 unchanged attributes hidden)
    }

  # module.github.github_repository.woolly_ui will be updated in-place
  ~ resource "github_repository" "woolly_ui" {
      ~ delete_branch_on_merge = false -> true
        id                     = "woolly-ui"
        name                   = "woolly-ui"
        # (25 unchanged attributes hidden)
    }

  # module.discord_simde.module.pierre_adorni.discord_member_roles.member_role["759778776560828447"] will be created
  + resource "discord_member_roles" "member_role" {
      + id        = (known after apply)
      + server_id = "759778767831957535"
      + user_id   = "322379809776861185"

      + role {
          + has_role = true
          + role_id  = "759778776560828447"
        }
    }

  # module.discord_simde.module.private-integ.discord_category_channel.category will be created
  + resource "discord_category_channel" "category" {
      + id        = (known after apply)
      + name      = "private-integ"
      + position  = 4
      + server_id = "759778767831957535"
      + type      = "category"
    }

  # module.discord_simde.module.private-integ.discord_channel_permission.admin[0] will be created
  + resource "discord_channel_permission" "admin" {
      + allow        = 100696136
      + channel_id   = (known after apply)
      + deny         = 197889
      + id           = (known after apply)
      + overwrite_id = "759778778212991066"
      + type         = "role"
    }

  # module.discord_simde.module.private-integ.discord_channel_permission.member_denied[0] will be created
  + resource "discord_channel_permission" "member_denied" {
      + channel_id   = (known after apply)
      + deny         = 197889
      + id           = (known after apply)
      + overwrite_id = "759778776560828447"
      + type         = "role"
    }

  # module.discord_simde.module.private-integ.discord_text_channel.text will be created
  + resource "discord_text_channel" "text" {
      + category                 = (known after apply)
      + id                       = (known after apply)
      + name                     = "private-integ"
      + nsfw                     = false
      + position                 = 0
      + server_id                = "759778767831957535"
      + sync_perms_with_category = true
      + type                     = "text"
    }

  # module.discord_simde.module.private-integ.discord_voice_channel.voice will be created
  + resource "discord_voice_channel" "voice" {
      + bitrate                  = 64000
      + category                 = (known after apply)
      + id                       = (known after apply)
      + name                     = "private-integ"
      + position                 = 1
      + server_id                = "759778767831957535"
      + sync_perms_with_category = true
      + type                     = "voice"
    }

Plan: 7 to add, 7 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
```

</details>

*Pusher: @maxime-vaillant, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform CI`*